// ignore_for_file: non_constant_identifier_names

import 'package:p2w_cards/models/privacy_policy.dart';

PrivacyPolicy POLITICA_DE_PRIVACIDADE_RUSSO = PrivacyPolicy(
  id: '003',
  language: 'Русский',
  countryFlagUrl:
      'https://upload.wikimedia.org/wikipedia/en/thumb/f/f3/Flag_of_Russia.svg/180px-Flag_of_Russia.svg.png',
  content: '''
Политика конфиденциальности - Карты P2W
P2W Cards, юридическое лицо, регулируемое частным правом, серьезно относится к вашей конфиденциальности и заботится о безопасности и защите данных всех своих клиентов, партнеров, поставщиков и пользователей домена https://www.p2wcards.com.br/ и любых другой веб-сайт, магазин или приложение, управляемое продавцом.

Настоящая Политика конфиденциальности предназначена для информирования вас о том, как мы используем и раскрываем информацию, полученную в результате ваших посещений нашего магазина и из сообщений, которыми мы обмениваемся с вами.

Настоящая Политика конфиденциальности применяется только к информации, собираемой через магазин.

ЗАХОДЯ В МАГАЗИН, ОТПРАВЛЯЯ СООБЩЕНИЯ ИЛИ ПРЕДОСТАВЛЯЯ ЛЮБЫЕ ТИПЫ ПЕРСОНАЛЬНЫХ ДАННЫХ, ВЫ РЕШАЕТЕ ОЗНАКОМИТЬСЯ С УСЛОВИЯМИ, ИЗЛОЖЕННЫМИ НАСТОЯЩИМ И В СООТВЕТСТВИИ С ПОЛИТИКОЙ КОНФИДЕНЦИАЛЬНОСТИ, КОТОРАЯ ОПИСЫВАЕТ ЦЕЛИ И СПОСОБЫ ОБРАБОТКИ ВАШИХ ПЕРСОНАЛЬНЫХ ДАННЫХ, КОТОРЫЕ ВЫ ПРЕДОСТАВЛЯЕТЕ В ХРАНИТЬ.

В настоящей Политике конфиденциальности представлен обзор наших методов обеспечения конфиденциальности и возможных вариантов выбора, а также прав, которыми вы можете воспользоваться в отношении обрабатываемых нами Персональных данных. Если у вас есть какие-либо вопросы об использовании Персональных данных, свяжитесь с нами по адресу p2wcards@p2w.com.br.

Кроме того, Политика конфиденциальности не распространяется на какие-либо сторонние приложения, продукты, услуги, веб-сайты или функции социальных сетей, которые могут быть предложены или доступны через магазин. Переход по этим ссылкам приведет к тому, что вы покинете наш сайт, что может привести к сбору или передаче информации о вас третьим лицам. Мы не контролируем, не одобряем и не делаем никаких заявлений о сторонних веб-сайтах или их методах обеспечения конфиденциальности, которые могут отличаться от наших. Мы рекомендуем вам ознакомиться с политикой конфиденциальности любого веб-сайта, с которым вы взаимодействуете, прежде чем разрешать сбор и использование ваших Персональных данных.

Если вы отправляете нам Персональные данные, касающиеся других лиц, вы заявляете, что обладаете соответствующей компетенцией, и заявляете, что получили необходимое согласие на разрешение использования такой информации в соответствии с условиями настоящей Политики конфиденциальности.
Раздел 1 - Определения
Для целей настоящей Политики конфиденциальности:

«Персональные данные»: означает любую информацию, которая прямо или косвенно идентифицирует или может идентифицировать физическое лицо, например, имя, CPF, дату рождения, IP-адрес и т. д.;
«Конфиденциальные персональные данные»: означает любую информацию, которая раскрывает в отношении физического лица расовое или этническое происхождение, религиозные убеждения, политические взгляды, членство в профсоюзе или организации религиозного, философского или политического характера, данные, касающиеся здоровья. или сексуальная жизнь, генетические или биометрические данные;
«Обработка Персональных данных» означает любую операцию, выполняемую в рамках Персональных данных с помощью автоматических средств или нет, такую ​​как сбор, запись, организация, структурирование, хранение, адаптация или изменение, извлечение, консультация, использование, раскрытие передача, распространение или, альтернативно, предоставление, гармонизация или объединение, ограничение, устранение или уничтожение. Любая иная операция, предусмотренная применимым законодательством, также считается Обработкой Персональных данных;
«Законы о защите данных»: означает все правовые положения, регулирующие обработку персональных данных, включая, помимо прочего, Закон № 13.709/18, Общий закон о защите персональных данных («LGPD»).
Раздел 2 - Использование персональных данных
Мы собираем и используем Персональные данные для управления вашими отношениями с нами и повышения качества обслуживания при покупке продуктов и/или услуг в магазине, персонализации и улучшения вашего опыта. Примеры того, как мы используем данные, включают:

Дать вам возможность приобретать товары и/или услуги в магазине;
Чтобы подтвердить или исправить информацию, которую мы храним о вас;
Для предоставления информации, которая, по нашему мнению, может вас заинтересовать;
Для персонализации вашего магазина;
Для связи с вами по указанному номеру телефона и/или адресу электронной почты. Мы можем связаться с вами лично, с помощью голосового сообщения, с помощью оборудования для автоматического набора номера, с помощью текстового сообщения (SMS), по электронной почте или с помощью любых других средств связи, которые ваше устройство способно принимать, в соответствии с положениями закона и на разумных условиях. деловые цели.
Кроме того, предоставленные Персональные данные также могут использоваться так, как мы сочтем необходимым или целесообразным: (а) в соответствии с Законами о защите данных; (b) для удовлетворения требований судебного процесса; (c) для выполнения решения суда, решения регулирующего органа или решения компетентных органов, в том числе органов за пределами страны проживания; (d) для обеспечения соблюдения наших Условий использования; (e) для защиты наших операций; (е) для защиты прав, конфиденциальности, безопасности нас, вас или других лиц; (g) для обнаружения и предотвращения мошенничества; (h) позволить нам использовать доступные средства правовой защиты или ограничить ущерб, который прийти страдать; и (i) другими способами, разрешенными законом.
Раздел 3. Непредоставление персональных данных
Мы не обязаны предоставлять Персональные данные, которые мы запрашиваем. Однако, если вы решите не делиться ими, в некоторых случаях мы не сможем предоставить вам полный доступ к магазину, некоторым специализированным ресурсам или сможем оказать необходимую помощь или даже обеспечить доставку товара. или предоставить услуги по контракту для вас.

Раздел 4 - Собранные данные
Широкая публика сможет просматривать магазин без какой-либо регистрации и предоставления Персональных данных. Однако некоторые функции магазина могут зависеть от регистрации и отправки Персональных данных, таких как завершение покупки/заключение договора на услугу и/или предоставление нам возможности предоставить продукт/предоставление услуги.

Обратившись в магазин, мы можем забрать:

Контактные данные: имя, фамилия, номер телефона, адрес, город, штат и адрес электронной почты;
Отправляемая информация: информация, которую вы отправляете через форму (вопросы, жалобы, предложения, критика, комплименты и т. д.).
При общей навигации по магазину мы можем собирать:

Данные о местоположении: данные о геолокации при доступе к магазину;
Предпочтения: информация о ваших предпочтениях и интересах в отношении продуктов/услуг (когда вы сообщаете нам, что они из себя представляют, или когда мы выводим их из того, что нам известно о вас);
Хранить данные просмотра: информацию о ваших посещениях и действиях, включая контент (и любую рекламу), который вы просматриваете и с которым взаимодействуете, информацию об используемом вами браузере и устройстве, ваш IP-адрес, ваше местоположение, адрес сайта, с которого вы прибыли. Часть этой информации собирается с помощью наших инструментов автоматического сбора данных, которые включают файлы cookie, веб-маяки и встроенные веб-ссылки. Чтобы узнать больше, прочитайте, как мы используем инструменты автоматического сбора данных, в разделе 7 ниже;
Анонимные или агрегированные данные: анонимные ответы на опросы или анонимная агрегированная информация о том, как пользуются магазином. Во время нашей работы в некоторых случаях мы применяем процесс деидентификации или псевдонимизации ваших данных, поэтому маловероятно, что вы идентифицируете себя с помощью этих данных с помощью доступных технологий;
Другая информация, которую мы можем собирать: информация, которая не раскрывает конкретно вашу личность или не имеет прямого отношения к физическому лицу, например информация о браузере и устройстве; хранить данные об использовании; и информация, собранная с помощью файлов cookie, пиксельных тегов и других технологий.
Мы не собираем Конфиденциальные персональные данные.

Раздел 5. Передача персональных данных третьим лицам
Мы можем передавать ваши Персональные данные:

С партнерской компанией (компаниями), которую вы выбираете или выбираете для предоставления своих данных, запросов, вопросов и т. д., а также с поставщиками услуг или партнерами для управления или поддержки определенных аспектов наших деловых операций на нашем веб-сайте. Эти поставщики услуг или партнеры могут находиться в США, Аргентине, Бразилии или других странах мира, включая серверы для утверждения и производства, а также поставщиков хостинга и хранения данных, управления мошенничеством, поддержки клиентов, продаж от нашего имени, выполнения заказов, например, персонализация контента, рекламная и маркетинговая деятельность (включая цифровую и персонализированную рекламу) и ИТ-услуги;
С третьими лицами, чтобы помочь нам управлять магазином;
С третьими лицами в случае любой реорганизации, слияния, продажи, создания совместного предприятия, уступки, передачи или передачи всей или части нашей компании, активов или капитала (включая те, которые связаны с банкротством или аналогичными процедурами).
Раздел 6 – Международная передача данных
Персональные данные и другая информация, собранная нами, могут быть переданы или доступны организациям, принадлежащим к корпоративной группе компаний-партнеров по всему миру, в соответствии с настоящей Политикой конфиденциальности.
Раздел 7 - Автоматический сбор персональных данных
Когда вы посещаете магазин, он может сохранять или извлекать информацию в вашем браузере, в основном в виде файлов cookie, которые представляют собой текстовые файлы, содержащие небольшое количество информации. Эта информация может касаться вас, ваших предпочтений или вашего устройства и в основном используется для того, чтобы магазин работал так, как вы ожидаете. Эта информация обычно не идентифицирует вас напрямую, но может обеспечить более персонализированный доступ в Интернет.

В соответствии с настоящей Политикой конфиденциальности мы и наши сторонние поставщики услуг с вашего согласия можем собирать ваши Персональные данные различными способами, включая, помимо прочего:

Через браузер или устройство: некоторая информация собирается большинством браузеров или автоматически через устройства доступа в Интернет.
ternet, такие как тип компьютера, разрешение экрана, название и версия операционной системы, модель и производитель устройства, язык, тип и версия используемого вами интернет-браузера. Мы можем использовать эту информацию для обеспечения правильной работы магазина.
Использование файлов cookie: информация об использовании вами магазина может быть собрана третьими лицами из файлов cookie. Файлы cookie — это информация, хранящаяся непосредственно на используемом вами компьютере. Файлы cookie позволяют собирать такую ​​информацию, как тип браузера, время, проведенное в магазине, посещенные страницы, языковые настройки и другие анонимные данные о трафике. Мы и наши поставщики услуг используем информацию в целях безопасности, чтобы упростить просмотр, более эффективно отображать информацию и персонализировать ваш опыт при использовании магазина, а также для онлайн-отслеживания. Мы также собираем статистическую информацию об использовании магазина, чтобы постоянно улучшать наш дизайн и функциональность, понимать, как используется магазин, и помогать вам в решении проблем, связанных с магазином.

Если вы не хотите, чтобы ваша информация собиралась с помощью файлов cookie, в большинстве браузеров существует простая процедура, позволяющая автоматически отклонять файлы cookie или дающая вам возможность принять или отклонить передачу определенного файла cookie (или файлов cookie) (ов). ) с определенного веб-сайта на ваш компьютер. Однако это может вызвать неудобства в использовании магазина.

Выбранные вами настройки могут повлиять на ваш опыт просмотра и операции, требующие использования файлов cookie. В связи с этим мы отказываемся от какой-либо ответственности за последствия, возникшие в результате ограниченной работы магазина, вызванной деактивацией файлов cookie на вашем устройстве (невозможность установить или прочитать файл cookie).
Использование пиксельных тегов и других подобных технологий: пиксельные теги (также известные как веб-маяки и невидимые GIF-файлы) могут использоваться для отслеживания действий пользователей магазина (включая получателей электронной почты), оценки успеха наших маркетинговых кампаний и сбора статистических данных о магазине. использование и скорость отклика, а также для других неуказанных целей. Мы можем привлекать компании, занимающиеся поведенческой рекламой, для получения отчетов о рекламе в магазинах в Интернете. С этой целью эти компании используют файлы cookie, пиксельные теги и другие технологии для сбора информации об использовании вами или другими пользователями нашего магазина и сторонних веб-сайтов. Мы не несем ответственности за пиксельные теги, файлы cookie и другие подобные технологии, используемые третьими лицами.
Раздел 8 - Категории файлов cookie
Файлы cookie, используемые в нашем магазине, соответствуют требованиям законодательства и относятся к следующим категориям:

Строго необходимо: эти файлы cookie позволяют безопасно просматривать сайт и пользоваться основными функциями. Примером могут служить файлы cookie безопасности, которые аутентифицируют пользователей, защищают их данные и предотвращают создание мошеннических входов в систему.
Производительность: файлы cookie в этой категории собирают информацию в зашифрованной и анонимной форме, связанную с нашим интернет-магазином, такую ​​как, например, количество посетителей определенной страницы, происхождение посещений веб-сайта и страницы, к которым обращался пользователь. Все собранные данные используются только для возможных улучшений веб-сайта и для измерения эффективности нашего общения.
Функциональность: эти файлы cookie используются для запоминания настроек предпочтений пользователя, чтобы улучшить ваше посещение нашего веб-сайта, таких как, например, настройки, применяемые к макету веб-сайта, или ваши ответы на рекламные объявления и всплывающие окна регистрации; таким образом, вам не придется спрашивать снова и снова.
Реклама: мы используем файлы cookie для создания целевых кампаний и показа рекламы в соответствии с вашим профилем потребления в нашем виртуальном магазине.
Раздел 9 - Права пользователя
Вы можете в любое время запросить: (i) подтверждение того, что ваши Персональные данные обрабатываются; (ii) доступ к вашим Персональным данным; (iii) исправления неполных, неточных или устаревших данных; (iv) анонимизация, блокировка или удаление ненужных, избыточных или обработанных данных в нарушение закона; (v) перенос Персональных данных другому поставщику услуг, если это не затрагивает наши промышленные и торговые секреты; (vi) удаление Персональных данных, обрабатываемых с вашего согласия, в пределах, разрешенных законом; (vii) информацию о лицах, которым были переданы ваши Персональные данные; (viii) информацию о возможности непредоставления согласия и последствиях непредоставления согласия; и (ix) отзыв согласия. Ваши запросы будут рассматриваться с особой тщательностью, чтобы мы могли обеспечить эффективность ваших прав. Вас могут попросить предоставить удостоверение личности, чтобы для обеспечения того, чтобы обмен Персональными данными осуществлялся только с держателем.

Вы должны иметь в виду, что в определенных случаях (например, из-за требований законодательства) ваш заказ может быть выполнен не сразу, и мы не сможем его выполнить из-за юридических обязательств.
Раздел 10 - Безопасность персональных данных
Мы стремимся принять технические и организационные меры, предусмотренные Законами о защите данных, подходящие для защиты Персональных данных в нашей организации. К сожалению, ни одна система передачи или хранения данных не может гарантировать 100% безопасность. Если у вас есть основания полагать, что ваше взаимодействие с нами больше не является безопасным (например, если вы считаете, что безопасность какой-либо из ваших учетных записей была нарушена), немедленно сообщите нам об этом.

Раздел 11 - Гиперссылки на другие веб-сайты и социальные сети
Магазин может время от времени содержать гипертекстовые ссылки, которые перенаправляют вас на веб-сайты сетей наших партнеров, рекламодателей, поставщиков и т. д. Если вы нажмете на одну из этих ссылок на любой из этих сайтов, помните, что каждый сайт имеет свои собственные правила конфиденциальности, и мы не несем ответственности за эти правила. Пожалуйста, ознакомьтесь с этими политиками, прежде чем отправлять какие-либо личные данные на эти сайты.

Мы не несем ответственности за политику и методы сбора, использования и раскрытия информации (включая методы защиты данных) других организаций, таких как Facebook, Apple, Google, Microsoft или любого другого разработчика программного обеспечения или поставщика приложений, медиамагазина, социальных сетей, операционной системы. , поставщика услуг беспроводного доступа в Интернет или производителя устройства, включая все Персональные данные, которые вы раскрываете другим организациям через приложения, в связи с такими приложениями или публикуете на наших страницах в социальных сетях. Мы рекомендуем вам ознакомиться с политикой конфиденциальности каждого веб-сайта, который вы посещаете, или каждого поставщика услуг, которым вы пользуетесь.
Раздел 12 - Обновления настоящей Политики конфиденциальности
Если мы изменим нашу Политику конфиденциальности, мы опубликуем новый текст в магазине с обновленной датой редакции. Мы можем изменить настоящую Политику конфиденциальности в любое время. Если в условия настоящей Политики конфиденциальности внесены существенные изменения, мы можем сообщить вам об этом через контактную информацию, которая есть в нашей базе данных, или через уведомление в нашем магазине.

Напоминаем вам, что мы обязуемся не обрабатывать ваши Персональные данные способом, несовместимым с целями, описанными выше, если иное не требуется по закону или по решению суда.

Использование вами магазина после внесения изменений означает, что вы принимаете пересмотренные Политики конфиденциальности. Если после прочтения исправленной версии вы не согласны с ее условиями, пожалуйста, прекратите доступ к магазину.
Раздел 13 - Лицо, ответственное за обработку персональных данных
Если вы хотите воспользоваться какими-либо правами, предусмотренными настоящей Политикой конфиденциальности и/или Законами о защите данных, в том числе отозвать свое согласие, или разрешить любые сомнения, связанные с обработкой ваших персональных данных, свяжитесь с нами по адресу p2wcards@p2w..com
''',
);
